Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Creates and returns a type checking result with the specified regular expression data.
ja: 指定された正規表現データを使った型チェックの結果を作成して返します。

source: Creates and returns an NSBlock Operation object and adds the specified block to it.
ja: NSBlock Operationオブジェクトを作成して返します、そして指定されたブロックをそれに加えます。

source: Creates and returns an ISO 8601 formatted string representation of the specified date.
ja: 指定された日付のISO 8601書式設定された文字列表現を作成して返します。

source: Creates and returns an array containing a given object.
ja: １つの与えられたオブジェクトを含んでいる配列を作成して返します。

source: Creates and returns an array containing the contents of the file specified by a given path.
ja: 与えられたパスによって指定されるファイルの内容を含んでいる配列を作成して返します。

source: Creates and returns an array containing the contents specified by a given URL.
ja: 与えられたURLによって指定される内容を含んでいる配列を作成して返します。

source: Creates and returns an array containing the objects in another given array.
ja: 別の与えられた配列の中のオブジェクトを含んでいる配列を作成して返します。

source: Creates and returns an array containing the objects in the argument list.
ja: 引数リストの中のオブジェクトを含んでいる配列を作成して返します。

source: Creates and returns an array that includes a given number of objects from a given C array.
ja: 指定された数のオブジェクトを指定されたC配列から含める配列を作成して返します。

source: Creates and returns an empty array.
ja: 空の配列を作成して返します。

source: Creates and returns an instance of a scriptable class, setting its contents and properties, for insertion into the relationship identified by the key.
ja: スクリプト対応クラスのインスタンスを作成して返します、それの内容とプロパティを設定します、キーによって識別されるリレーションシップへの挿入のためです。

source: Creates and returns one or more scripting objects to be inserted into the specified relationship by copying the passed-in value and setting the properties in the copied object or objects.
ja: 指定されたリレーションシップへと挿入されるひとつ以上のスクリプティングオブジェクトを作成して返します、それは渡された値をコピーしてコビーされたオブジェクトまたは複数オブジェクトにおいてプロパティを設定することによってです。

source: Creates data with copied memory content.
ja: コピーされたメモリ内容でデータを作成します。

source: Creates two rectangles—slice and rem—from in Rect, by dividing in Rect with a line that’s parallel to the side of in Rect specified by edge.
ja: ２つの矩形 — sliceとrem — をin Rectから、in Rectをedgeによって指定されるin Rectの辺に平行なある線で分割することによって作成します。

source: Creating Data from Raw Memory
ja: 生のメモリがデータを作成する

source: Creating Dimensions
ja: 寸法を作成する

source: Creating Empty Data
ja: 空のデータを作成する

source: Creating File Wrappers
ja: ファイルラッパーを作成する

source: Creating Hosts
ja: ホストを作成する

source: Creating ISO 8601 Date Formatters
ja: ISO 8601日付フォーマッタを作成する

source: Creating Index Paths
ja: インデックスパスを作成する

source: Creating Populated Data
ja: 事前入力されたDataを作成する

source: Creating Regular Expressions
ja: 正規表現を作成する

source: Creating Streams
ja: ストリームを作成する

source: Creating Strings from Byte Count
ja: バイト計数から文字列を作成する

source: Creating Symbolic and Hard Links
ja: シンボリックおよびハードリンクを作成する

source: Creating Transforms
ja: 変換の作成

source: Creating a Calendar
ja: カレンダーを作成する

source: Creating a Custom Character Set
ja: あつらえの文字集合を作成する

source: Creating a Custom NSDimension Subclass
ja: あつらえのNSDimensionサブクラスを作成する

source: Creating a Date
ja: 日付の作成

source: Creating a Date Interval
ja: 日付間隔を作成する

source: Creating a Decimal from Another Decimal
ja: 10進数を別の10進数から作成する

source: Creating a Decimal from Components
ja: いくつかの構成要素からDecimalを作製する

source: Creating a Decimal from a Floating Point Number
ja: Decimalを浮動小数点数から作成する

source: Creating a Decimal from an Integer
ja: 整数から10進数を作成する

source: Creating a Decimal from an Unsigned Integer
ja: 符号なし整数から10進数を作成する

source: Creating a Dictionary
ja: 辞書の作成

source: Creating a File Handle
ja: ファイルハンドルを作成する

source: Creating a File Manager
ja: あるファイルマネージャを作成する

source: Creating a Set
ja: 集合の作成

source: Creating a cached URL response
ja: キャッシュされたURL応答を作成する

source: Creating an Array
ja: 配列の作成

source: Creating an Empty Decimal
ja: 空のDecimalを作成する

source: Creating an Index Set
ja: インデックス集合を作成する

source: Creating and Deleting Items
ja: 項目の作成と消去

source: Creating and Initializing Descriptors
ja: 記述子の作成と初期化

source: Creating and Initializing a Bundle
ja: バンドルの作成と初期化

source: Creating and Managing Bitmap Representations
ja: ビットマップ表現の作成と管理

source: Creating, Copying, and Deallocating Objects
ja: オブジェクトの作成、複製、そして割り当て解除

source: Currently only one type, NSLocal Notification Center Type, is supported.
ja: 現在はただ１つの型、NSLocal Notification Center Typeだけがサポートされます。

source: Currently provides no indication if an error occurs.
ja: 今のところエラーが起こるならば何の兆候も示しません。

source: Currently there is a single type—NSLocal Notification Center Type.
ja: 現在はただ１つの型 — NSLocal Notification Center Typeがあります。

source: Currently unused.
ja: 現在使われません。

source: Custom Decoding
ja: カスタムでデコードする

source: Custom Encoding
ja: あつらえのエンコーディング

source: Custom Encoding and Decoding
ja: カスタムエンコーディングとデコーディング

source: Custom Formats
ja: あつらえの書式設定

source: Custom Formatters
ja: あつらえのフォーマッタ

source: Custom Replace Functionality
ja: カスタムの置換機能性

source: Custom mappings let you to apply the Swift API Design Guidelines to the names of properties in your Swift model, even if the names of the JSON keys are different.
ja: あつらえのマッピングは、あなたにSwift API Design GuidelinesをあなたのSwiftモデルの中のプロパティの名前に適用させます、たとえJSONキーの名前が異なるとしてもです。

source: Custom units can be initialized from a symbol and converter of an existing type or implemented as a class method of an existing type for additional convenience.
ja: あつらえの単位は、既存の型のシンボルとコンバータから初期化されることまたは追加の利便性のために既存の型のクラスメソッドとして実装されることができます、

source: CustomNSError Implementations
ja: CustomNSError実装

source: Customizing Decoding
ja: あつらえのデコーディング

source: Customizing Encoding
ja: エンコーディングをあつらえる

source: D < ε the inverse is undefined and will be nil
ja: D < ε この反転は未定義でnilになります

source: Data Decoding
ja: データをデコードする

source: Data Encoding
ja: データエンコーディング

source: Data Formatting
ja: データ初期化

source: Data Sizes
ja: データサイズ

source: Data Types
ja: さまざまなデータ型

source: Data objects let simple allocated buffers (that is, data with no embedded pointers) take on the behavior of Foundation objects.
ja: データオブジェクトは、単純な割り当てられたバッファ（すなわち、埋め込まれたポインタを持たないデータ）にFoundationオブジェクトの挙動を取らせます。

source: Data of this format is returned by such methods as serialized Representation and rtfd(from: document Attributes:) (NSAttributed String).
ja: この形式のデータは、serialized Representation and rtfd(from: document Attributes:) (NSAttributed String) のようなメソッドによって返されます。

source: Date Formatting
ja: 日付を書式設定する

source: Date Representations
ja: 日付表現

source: Date and Time with space separator between date and time
ja: 日付と時刻の間に空白区切を持つ日付と時刻

source: Date objects are immutable, representing an invariant time interval relative to an absolute reference date (00:00:00 UTC on 1 January 2001).
ja: Dateオブジェクトは不変です、ある変化しない時間間隔を、絶対参照日付（2001 January 1 での 00:00:00 UTC）に相対して表します。

source: Date values represent a time interval relative to an absolute reference date.
ja: 日付値は、絶対基準日に相対して時間間隔を表します。

source: Date with dash separators
ja: ダッシュ区切りでの日付

source: DateInterval does not support reverse intervals i.e. intervals where the duration is less than 0 and the end date occurs earlier in time than the start date.
ja: DateInterval は逆の間隔をサポートしません、すなわち、期間が０より少ないそして終了日付が開始日付より早い時間で見出されるところの間隔。

source: DateInterval represents a closed date interval in the form of [startDate, endDate].
ja: DateInterval は、完結日付間隔を形式 [startDate, endDate] において表します。

source: Dates and Times
ja: 日付と時刻

source: Deallocates the memory occupied by the receiver.
ja: レシーバによって占有されたメモリを割り当て解除します。

source: Deallocates the specified block of memory.
ja: 指定されたメモリのブロックをデアロケートします。

source: Declaration
ja: 宣言

source: Declare conformance to Encodable if you only need to support the encoding of data.
ja: Encodableへの準拠を、あなたがデータのエンコーディングの支援のみを必要とするならば宣言してください。

source: Decodes and returns the object archived in a given NSData object.
ja: 与えられたNSDataオブジェクトの中にアーカイブされるオブジェクトをデコードして返します。

source: Decoding Dates
ja: 日付をデコードする

source: Decoding Exceptional Numbers
ja: 普通でない数をデコードする

source: Decoding Raw Data
ja: 生のデータをデコードする

source: Decoding options.
ja: デコードのオプション。

source: Decrements the specified object’s reference count.
ja: 指定されたオブジェクトの持つ参照カウントを漸減します。

source: Default Formats
ja: 省略時の書式設定

source: Default Implementations
ja: デフォルト実装

source: Default distributed notification center for the computer.
ja: コンピュータのための省略時の分散通知センター。

source: Default is "0".
ja: 省略時は"0"です。

source: Default is .forward.
ja: 省略時は.forwardです。

source: Default is true.
ja: 省略時はtrueです。

source: Default value is .first.
ja: 省略時の値は.firstです。

source: Default value is .next Time.
ja: 省略時の値は.next Timeです。

source: Default value is [].
ja: 省略時の値は[]です。

source: Default value is false.
ja: 省略時の値はfalseです。

source: Default value is nil, which means the entire content of this data.
ja: 省略時の値はnilです、このデータの内容全体を意味します。

source: Default value is true.
ja: 省略時の値はtrueです。

source: Defines a structure that contains the function pointers used to configure behavior of NSHash Table with respect to elements within a hash table.
ja: ハッシュテーブル内の要素に関して、NSHash Tableの挙動を設定するのに使われる関数ポインタを含んでいる構造体を定義します。

source: Defines the signature for a block object used for comparison operations.
ja: 比較演算に使われるブロックオブジェクトに対するシグネチャを定義します。

source: Defining these relationships between classes allows for more intelligent and flexible manipulation of objects with key-value coding.
ja: これらのクラス間の関係の定義は、キー値コーディングを使うオブジェクトのより知的で柔軟な取り扱いを想定します。

source: Deletes the elements of the specified hash table.
ja: 指定されたハッシュテーブルの要素を削除します。

source: Deletes the elements of the specified map table.
ja: 指定されたマップテーブルの要素を削除します。

source: Deletes the specified cookie from the cookie storage.
ja: 指定されたクッキーをクッキーストレージから削除します。

source: Deletes the specified hash table.
ja: 指定されたハッシュテーブルを削除します。

source: Deletes the specified map table.
ja: 指定されたマップテーブルを削除します。

source: Demonstrates approaches for encoding and decoding different kinds of JSON in Swift.
ja: さまざまなJSONエンコードおよびデコードする取り組みをSwiftにおいて実演します。

source: Depending on the type, it may make sense to allocate more or less storage than requested or to take no action at all.
ja: 型によって、要請されたよりも多くまたは少なく割り当てるまたは全く行動を起こさないことが道理にかなっているかもしれません。

source: Deprecated
ja: 非推奨

source: Deprecated Methods
ja: 非推奨メソッド

source: Deprecated: As of Xcode 4.3, there is no longer a Developer Application directory directory; instead, Xcode.app is a self-contained application that gets installed in the user’s Applications directory, by default, although it can be put anywhere.
ja: 非推奨：Xcode 4.3の時点で、もはやDeveloper Applicationディレクトリはありません；代わりにXcode.appは自給自足のアプリケーションです、それはユーザのApplicationsディレクトリにインストールされます、初期状態で、もっともそれはどこか他に置かれることができます。

source: Deprecated: As of Xcode 4.3, there is no longer a Developer directory; instead, Xcode.app is a self-contained application that gets installed in the user’s Applications directory, by default, although it can be put anywhere.
ja: 非推奨：Xcode 4.3の時点で、もはやDeveloperディレクトリはありません；代わりにXcode.appは自給自足のアプリケーションです、それはユーザのApplicationsディレクトリにインストールされます、初期状態で、もっともそれはどこか他に置かれることができます。

source: Derived from the "with properties" parameter of a duplicate command.
ja: duplicateコマンドの「with properties」パラメータから引き出されます。

source: Deriving New Arrays
ja: 新しい配列を派生させる

source: Describes an error in the Mach error domain.
ja: Machエラー領域内のエラーを記述します。

source: Describes an error in the POSIX error domain.
ja: POSIXエラー領域内のエラーを記述します。

source: Describes errors within the Cocoa error domain.
ja: Cocoaエラー領域内のエラーを記述します。

source: Describes the macOS Objective-C runtime library support functions and data structures.
ja: 関数とデータ構造体をサポートするmacOS Objective-Cランタイムライブラリを記述します。

source: Describing Data
ja: データを記述する

source: Describing Date Components
ja: 日付構成要素を記述する

source: Describing Dates
ja: 日付を記述する

source: Describing Objects
ja: オブジェクトの解説

source: Describing a Calendar
ja: カレンダーを記述する

source: Describing a Character Set
ja: 文字集合を記述する

source: Describing a Date Interval
ja: 日付間隔を記述する

source: Describing a Decimal
ja: 10進数を記述する

source: Describing a Set
ja: あるSetの記述

source: Describing a Transform
ja: 変換を記述する

source: Describing an Index
ja: インデックスを記述する

source: Describing an Index Path
ja: インデックスパスを記述する

source: Describing an Index Set
ja: インデックス集合を記述する

source: Description
ja: 説明

source: Descriptions
ja: 記述

source: Descriptors can be used to build arbitrarily complex containers, so that one Apple event can represent a script statement such as tell application "Text Edit" to get word 3 of paragraph 6 of document 3.
ja: いくらかの記述子が使われることで随意に複雑なコンテナを組み立てることが可能です、その結果ある１つのアップルイベントは１つのスクリプト文を表すことができます、例えばtell application "Text Edit" to get word 3 of paragraph 6 of document 3など。

source: Design patterns for broadcasting information and for subscribing to broadcasts.
ja: 情報放送のためのそして放送購買のための様式を設計します。

source: Destination pathname.
ja: 行き先パス名。

source: Destroys an existing object.
ja: 既存のオブジェクトの破棄

source: Determines if the date has all of the specified date components.
ja: 指定された日付構成要素のすべてを、この日付が持つかどうかを判定します。

source: Determines the behavior of the search algorithm when the input produces a time that occurs twice on a particular day.
ja: 入力が特定の日に２度起こる時間を生成する場合の検索アルゴリズムの挙動を決定します。

source: Determines the behavior of the search algorithm when the input produces an ambiguous result.
ja: 入力が曖昧な結果を生成する場合の検索アルゴリズムの挙動を決定します。

source: Determines the display style of the size representation.
ja: サイズ表現の表示形式を決定します。

source: Determines the type of relationship that exists between a directory and item.
ja: ディレクトリと項目の間に存在する関係の型を決定します。

source: Determines the type of relationship that exists between a system directory and the specified item.
ja: システムディレクトリと指定された項目の間に存在する関係の型を決定します。

source: Determines whether to allow more natural display of some values.
ja: いくつかの値のより自然な表示を可能にするかどうかを決定します。

source: Determines whether to include the count in the resulting formatted string.
ja: 結果となる書式設定された文字列に計数を含めるかどうかを決定します。

source: Determines whether to include the number of bytes after the formatted string.
ja: 書式設定した文字列の後にバイト数を含むかどうかを決定します。

source: Determines whether to include the units in the resulting formatted string.
ja: 結果となる書式設定された文字列に単位を含めるかどうかを決定します。

source: Determines whether to zero pad fraction digits so a consistent number of characters is displayed in a representation.
ja: ゼロで小数部に詰め物をするかどうかを決定します、それで一貫した文字数が表現において表示されます。

source: Determines which result to use when a time is repeated on a day in a calendar (for example, during a daylight saving transition when the times between 2:00am and 3:00am may happen twice).
ja: あるカレンダーのある日にある時間が繰り返される場合に使う結果を決定します（例えば、サマータイムの変わり目には、2:00amと3:00amの間の時間は２度起こるかもしれません）。

source: Determining Access to Files
ja: ファイルへのアクセスを決定する

source: Determining Composed Character Sequences
ja: 合成文字シーケンスを特定する

source: Determining Intersections
ja: 交わりを特定する

source: Determining Line and Paragraph Ranges
ja: 行と段落範囲を特定する

source: Determining Whether a Date Occurs Within a Date Interval
ja: 日付が日付間隔の内かどうかを判定する

source: Developer applications (/Developer/Applications).
ja: 開発アプリケーション（/Developer/Applications）。

source: Developer resources (/Developer).
ja: 開発リソース（/Developer）。

source: Development language resources (as specified by the CFBundleDevelopmentRegion key in the bundle’s Info.plist file)
ja: 開発言語リソース（バンドルの持つInfo.plistファイルの中のCFBundleDevelopmentRegionキーによって指定される通りに）

source: Diagnostics and Debugging
ja: 診断とデバッグ

source: Dictionary containing additional information.
ja: 追加情報を含んでいる辞書。

source: Dictionary key used to store file Wrapper in the directory’s list of file wrappers.
ja: file Wrapperをディレクトリの持つファイルラッパーのリストに格納するために使われる辞書キー。

source: Dictionary key used to store the file wrapper in the directory’s list of file wrappers.
ja: ファイルラッパーをディレクトリの持つファイルラッパーのリストに格納するために使われる辞書キー。

source: Dictionary key used to store the new file wrapper in the directory’s list of file wrappers.
ja: 新しいファイルラッパーをディレクトリの持つファイルラッパーのリストに格納するために使われる辞書キー。

source: Different locales have different conventions for the ordering of date components.
ja: 異なるロケールは、日付構成要素の順番に対して異なる慣例を持ちます。

source: Different locales switched at different times.
ja: 異なるロケールは、異なる時間で切り替えられます。

source: Differs from ^ in that \A will not match after a new line within the input.
ja: \Aはその入力範囲内においてひとつの新しい行の後にマッチしないということににおいて^と異なります。

source: Directory
ja: ディレクトリ

source: Disallows further access to the represented file or communications channel and signals end of file on communications channels that permit writing.
ja: 表現されたファイルまたは通信経路へのもっと先のアクセスを禁止します、そして書き込み許可する通信経路上のファイルの終端を合図します。

source: Discardable Content Proxy Support
ja: 内容代理の破棄サポート

source: Discovering Directory Contents
ja: ディレクトリ内容を発見する

source: Discussion
ja: 議論

source: Discussion: After an immutable array has been initialized in this way, it cannot be modified.
ja: 解説：不変の配列がこの方法で初期化され終わった後は、それが修正されることはできません。

source: Dismisses a modal view and returns the success or failure of the action.
ja: モデルビューを片付けて、そのアクションの成功または失敗を返します。

source: Display names are user-friendly names for files.
ja: 表示名は、ファイルに対するユーザに使いやすい名前です。

source: Displayed result
ja: 表示結果

source: Displaying values using zero pad fraction digits causes a consistent number of fraction digits are displayed, causing updating displays to remain more stable.
ja: 小数部のゼロ詰めを使って表示する値は、一貫した数の小数桁が表示されるようにして、表示の更新をより安定した状態にします。

source: Displays a more natural display of some values, such as zero, where it may be displayed as Zero KB, ignoring all other flags or options (with the exception of use Bytes, which would generate Zero bytes).The result is appropriate for standalone output.
ja: いくつかの値のより自然な表示を表示します、例えばゼロなど、そこにおいてそれはZero KBのように表示されるかもしれません、すべての他のフラグまたはオプションを無視します（use Bytesを除いては、それはZero bytesを生成するでしょう）。結果は、単独動作型の出力に適します。

source: Displays bytes in the formatter content.
ja: フォーマッタ内容においてバイト数を表示します。

source: Displays exabytes in the formatter content.
ja: フォーマッタ内容においてエクサバイト数を表示します。

source: Displays gigabytes in the formatter content.
ja: フォーマッタ内容においてギガバイト数を表示します。

source: Displays kilobytes in the formatter content.
ja: フォーマッタ内容においてキロバイト数を表示します。

source: Displays megabytes in the formatter content.
ja: フォーマッタ内容においてメガバイト数を表示します。

source: Displays petabyte in the formatter content.
ja: フォーマッタ内容においてペタバイト数を表示します。

source: Displays terabytes in the formatter content.
ja: フォーマッタ内容においてテラバイト数を表示します。

source: Displays yottabytes in the formatter content.
ja: フォーマッタ内容においてヨタバイト数を表示します。

source: Displays zettabytes in the formatter content.
ja: フォーマッタ内容においてゼタバイト数を表示します。

source: Distributed notification center for notification Center Type.
ja: notification Center Typeに対する分散通知センター。

source: Distributed notifications are delivered via a task’s run loop.
ja: 分散通知は、あるタスクの持つ実行ループ経由で配達されます。

source: Distributes notifications to all tasks on the sender’s computer.
ja: 送り手の持つコンピュータ上の全てのタスクに通知を配布します。

source: Divides left Operand by right Operand and stores the quotient, possibly rounded off according to rounding Mode, in result.
ja: right Operandをleft Operandで割ります、そして可能ならrounding Modeにしたがって丸めて、resultに商を格納します。

source: Divides a rectangle into two new rectangles.
ja: ある矩形を２つの新しい矩形へと分割します。

source: Divides one decimal number by another, storing the result in the first number.
ja: ある10進数を別のもので割ります、結果を最初の数に格納します。

source: Divides one decimal number by another.
ja: ある10進数を別のもので割ります。

source: Divides one decimal value by another.
ja: ある10進数値を別のもので割ります。

source: Do not call this initializer directly.
ja: このイニシャライザを直接に呼ばないでください。

source: Do not call this method from your app’s main thread.
ja: このメソッドをあなたのアプリのメインスレッドから呼び出さないでください。

source: Do not descend into packages.
ja: パッケージの中へと下りません。

source: Do not enumerate hidden files.
ja: 隠されたファイルを列挙しません。

source: Do not include these modifiers when specifying the name of the resource you want.
ja: あなたの望むリソースの名前を指定する場合これらの修飾子を含まないでください。

source: Do not override alloc to include initialization code.
ja: allocをオーバーライドして初期化コードを含めないでください。

source: Do not rely on a previously stored index value after altering a collection with any operation that can change its length.
ja: あるコレクションをそれの長さを変える何らかの演算で手直し後に、以前に格納されたインデックス値を当てにしないでください。

source: Do not use a coordinated write to perform this operation.
ja: 協調書き込みを使ってこの操作を実行しないでください。

source: Do not use these constants if you want an exact format.
ja: あなたが正確な書式設定を望むならば、これらの定数を使わないでください。

source: Do not use this method to unload bundles that were originally loaded using the bundle-manipulation functions in Core Foundation.
ja: Core Foundationのバンドル操作関数を使って元々はロードされたバンドルをアンロードするために、このメソッドを使わないでください。

source: Do nothing upon deallocation.
ja: デアロケートに関して何もしません。

source: Document directory.
ja: 書類ディレクトリ。

source: Documentation.
ja: 書類。

source: Does not advance the input position.
ja: 入力での位置を進めません。

source: Does not alter the input position.
ja: 入力位置を変えません。

source: Doing so can cause odd behavior or race conditions.
ja: そうすることは、思いがけない挙動や競合状態を引き起こす可能性があります。

source: Doing so cancels the dispatch source and cleans up the file handle’s structures appropriately.
ja: そうすることは、ディスパッチソースを取り消して、ファイルハンドラの持つ構造体を適切に片付けます。

source: Doing so gives you more control over the retrieval of items and more opportunities to complete the enumeration or perform other tasks at the same time.
ja: そうすることは、あなたに項目の検索にわたってさらなる制御を、そして列挙を完全なものにするまたは他のタスクを同時に実行するさらなる機会を与えます。

source: Don't use this option when reading a document file package, because that would cause unnecessarily bad performance.
ja: このオプションを書類ファイルパッケージを読み出す時に使わないでください、なぜならそれは必要以上に悪い性能の原因になるからです。

source: Don’t simply send version to the return value of class—a subclass version number may be returned instead.
ja: 単純にversionをクラスの戻り値に送らないでください—サブクラスバージョン数が代わりに返されるでしょう。

source: Don’t use this method to get the name of a child that's about to be written, because the name might be about to change; send key For Child File Wrapper(_:) to the parent instead.
ja: このメソッドを、書き出されようとしている子の名前を得るために使わないでください、なぜならその名前は変更されようとしているかもしれません；代わりにkey For Child File Wrapper(_:)を親に送ってください。

source: During decoding, the closure is called once for each key in the Decodable value being decoded.
ja: デコーディングの間、クロージャはデコードされるDecodable値の中の各キーに対して一度だけ呼び出されます。

source: During encoding, the closure is called once for each key in the Encodable value being encoded.
ja: エンコーディングの間、クロージャはエンコードされるEncodable値の中の各キーに対して一度だけ呼び出されます。

source: During keyed unarchiving, instances of the receiver will be decoded as members of the returned class.
ja: キー付きアンアーカイブの間に、レシーバのインスタンスはこの返された型のメンバーとしてデコードされます。

source: During the loading process, this method unarchives each object, initializes it, sets its properties to their configured values, and reestablishes any connections to other objects.
ja: ロード処理の間、このメソッドはめいめいのオブジェクトをアンアーカイブして、それを初期化して、それのいくらかのプロパティをそれらの構成設定の値に設定して、そして他のオブジェクトへのあらゆる接続を再確立します。

source: Dynamically Resolving Methods
ja: 動的に決定するメソッド

source: Dynamically loads the bundle’s executable code into a running program, if the code has not already been loaded.
ja: バンドルの持つ実行可能コードを動作しているプログラムに動的にロードします、もしコードがまだロードされていなかったならば。

source: Dynamically provides an implementation for a given selector for a class method.
ja: ある指定された、クラスメソッドに対するセレクタに、実装を動的に提供します。

source: Dynamically provides an implementation for a given selector for an instance method.
ja: ある指定された、インスタンスメソッドに対するセレクタに、実装を動的に提供します。

source: Each Host object may contain several addresses and have more than one name.
ja: 各Hostオブジェクトは、いくつかのアドレスを含み、そして複数の名前を持つかもしれません。

source: Each additional ubiquity container should be listed as an additional value in the com .apple .developer .ubiquity-container-identifiers entitlement array.
ja: 各追加的な偏在コンテナは、追加的な値としてcom .apple .developer .ubiquity-container-identifiers資格配列において一覧にされるべきです。

source: Each app that syncs documents to the cloud must have at least one associated ubiquity container in which to put those files.
ja: いろいろな書類をクラウドに同期する各アプリは、それらファイルをその中に置くところの、結び付けられた偏在コンテナを少なくとも１つ持たなければなりません。

source: Each application has at most one instance of NSApple Event Manager.
ja: 各アプリケーションは、最大で１つのNSApple Event Managerのインスタンスを持ちます。
